export default {
  projections: {
    ТехКартаE: {
      номерКарты: {
        __caption__: 'Номер карты'
      },
      дата: {
        __caption__: 'Дата'
      },
      чертеж: {
        __caption__: 'Чертеж',
        номерЧертежа: {
          __caption__: 'Номер чертежа'
        }
      },
      оборудование: {
        __caption__: 'Оборудование',
        наименование: {
          __caption__: 'Наименование'
        }
      }
    },
    ТехКартаL: {
      номерКарты: {
        __caption__: 'Номер карты'
      },
      дата: {
        __caption__: 'Дата'
      },
      чертеж: {
        __caption__: 'Номер чертежа',
        номерЧертежа: {
          __caption__: 'Номер чертежа'
        }
      },
      оборудование: {
        __caption__: 'Наименование',
        наименование: {
          __caption__: 'Наименование'
        }
      }
    }
  },
  validations: {
    дата: {
      __caption__: 'Дата'
    },
    номерКарты: {
      __caption__: 'Номер карты'
    },
    оборудование: {
      __caption__: 'Оборудование'
    },
    чертеж: {
      __caption__: 'Чертеж'
    }
  }
};
