export default {
  projections: {
    ТчЗаявкаE: {
      номерДетали: {
        __caption__: 'Номер детали'
      },
      наименДетали: {
        __caption__: 'Наимен детали'
      },
      количество: {
        __caption__: 'Количество'
      },
      цена: {
        __caption__: 'Цена'
      },
      материалы: {
        __caption__: 'Материалы',
        наименование: {
          __caption__: 'Наименование'
        }
      }
    }
  },
  validations: {
    количество: {
      __caption__: 'Количество'
    },
    наименДетали: {
      __caption__: 'Наимен детали'
    },
    номерДетали: {
      __caption__: 'Номер детали'
    },
    цена: {
      __caption__: 'Цена'
    },
    материалы: {
      __caption__: 'Материалы'
    },
    заявки: {
      __caption__: 'заявки'
    }
  }
};
