export default {
  projections: {
    ЗаявкиE: {
      номерЗаявки: {
        __caption__: 'Номер заявки'
      },
      датаЗаявки: {
        __caption__: 'Дата заявки'
      },
      клиенты: {
        __caption__: 'Клиенты',
        наименование: {
          __caption__: 'Наименование'
        }
      },
      тчЗаявка: {
        __caption__: 'Тч заявка',
        номерДетали: {
          __caption__: 'Номер детали'
        },
        наименДетали: {
          __caption__: 'Наимен детали'
        },
        количество: {
          __caption__: 'Количество'
        },
        цена: {
          __caption__: 'Цена'
        },
        материалы: {
          __caption__: 'Материалы',
          наименование: {
            __caption__: 'Наименование'
          }
        }
      }
    },
    ЗаявкиL: {
      номерЗаявки: {
        __caption__: 'Номер заявки'
      },
      датаЗаявки: {
        __caption__: 'Дата заявки'
      },
      клиенты: {
        __caption__: 'Наименование',
        наименование: {
          __caption__: 'Наименование'
        }
      }
    }
  },
  validations: {
    датаЗаявки: {
      __caption__: 'Дата заявки'
    },
    номерЗаявки: {
      __caption__: 'Номер заявки'
    },
    клиенты: {
      __caption__: 'Клиенты'
    },
    тчЗаявка: {
      __caption__: 'Тч заявка'
    }
  }
};
